In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [6]:
file_path=r"C:\Users\Starv\Downloads\Visadataset.csv"
visa_df=pd.read_csv(file_path)
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [16]:
file_path = r"C:\Users\Starv\Downloads\bank.csv"

visa_df = pd.read_csv(file_path, sep=';')

- shape
- size
- len
- columns
- dtypes
- isnull
- head
- tail
- info

In [18]:
visa_df.shape

(4521, 17)

In [19]:
print('the number of rows are:',visa_df.shape[0])
print('the number of rows are:',visa_df.shape[1])

the number of rows are: 4521
the number of rows are: 17

In [20]:
visa_df.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'y'],
      dtype='object')

In [21]:
len(visa_df.columns)

17

In [22]:
visa_df.size

76857

In [23]:
len(visa_df)

4521

In [24]:
visa_df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [25]:
visa_df.tail()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

In [26]:
visa_df.isnull()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4517,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4518,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4519,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4520,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [29]:
visa_df.isnull().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
y            0
dtype: int64

In [30]:
visa_df.dtypes

age           int64
job          object
marital      object
education    object
default      object
balance       int64
housing      object
loan         object
contact      object
day           int64
month        object
duration      int64
campaign      int64
pdays         int64
previous      int64
poutcome     object
y            object
dtype: object

In [31]:
type(visa_df)

pandas.core.frame.DataFrame

In [32]:
type(visa_df.dtypes)

pandas.core.series.Series

**task-1**
- I want to seperate categorical and numerical columns
- categorical columns in one list
- numerical columns in another list

In [33]:
visa_df.dtypes.keys()

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'y'],
      dtype='object')

In [34]:
visa_df.dtypes.values

array([dtype('int64'), dtype('O'), dtype('O'), dtype('O'), dtype('O'),
       dtype('int64'), dtype('O'), dtype('O'), dtype('O'), dtype('int64'),
       dtype('O'), dtype('int64'), dtype('int64'), dtype('int64'),
       dtype('int64'), dtype('O'), dtype('O')], dtype=object)

In [35]:
visa_df.dtypes.keys().tolist()

['age',
 'job',
 'marital',
 'education',
 'default',
 'balance',
 'housing',
 'loan',
 'contact',
 'day',
 'month',
 'duration',
 'campaign',
 'pdays',
 'previous',
 'poutcome',
 'y']

In [36]:
visa_df.dtypes.values.tolist()

[dtype('int64'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('int64'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('int64'),
 dtype('O'),
 dtype('int64'),
 dtype('int64'),
 dtype('int64'),
 dtype('int64'),
 dtype('O'),
 dtype('O')]

**series to list extract**

In [38]:
visa_df
visa_df.dtypes
visa_df.dtypes.keys()
visa_df.dtypes.values
visa_df.dtypes.keys().tolist()

['age',
 'job',
 'marital',
 'education',
 'default',
 'balance',
 'housing',
 'loan',
 'contact',
 'day',
 'month',
 'duration',
 'campaign',
 'pdays',
 'previous',
 'poutcome',
 'y']

In [39]:
cat=[]
for i,j in zip(dtype,cols):
    if i=='object':
        cat.append(j)
cat=[j for i,j in zip(dtype,cols) if i=='object']
num=[j for i,j in zip(dtype,cols) if i!='object']
len(cat),len(num)

NameError: name 'dtype' is not defined

In [40]:
dtype = visa_df.dtypes        # get datatype of each column
cols = visa_df.columns        # get all column names  correct way

cat = [col for col, t in zip(cols, dtype) if t == 'object']
num = [col for col, t in zip(cols, dtype) if t != 'object']

len(cat), len(num)

(10, 7)

In [41]:
a=['apple','banana','cherry']
b=[2,3,4]
for i,j in zip(a,b):
    if j%2==0:
        print(i)

apple
cherry

In [42]:
visa_df
visa_df.dtypes
visa_df.dtypes.keys()
cols=visa_df.dtypes.keys().tolist()
dtype=visa_df.dtypes.values.tolist()
cat=[j for i,j in zip(dtype,cols) if i=='object']
num=[j for i,j in zip(dtype,cols) if i!='object']
len(cat),len(num)

(10, 7)

**select dtypes**

In [43]:
cat=visa_df.select_dtypes(include='object').columns
num=visa_df.select_dtypes(exclude='object').columns

**task-2:convert series to dataframe**

In [44]:
dtypes=visa_df.dtypes
d1=pd.DataFrame(dtypes,columns=['Data type'])
d1.reset_index().rename(columns={'index':'Column'})

       Column Data type
0         age     int64
1         job    object
2     marital    object
3   education    object
4     default    object
5     balance     int64
6     housing    object
7        loan    object
8     contact    object
9         day     int64
10      month    object
11   duration     int64
12   campaign     int64
13      pdays     int64
14   previous     int64
15   poutcome    object
16          y    object

In [45]:
visa_df.dtypes.keys()

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'y'],
      dtype='object')

In [47]:
visa_df.dtypes.index

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'y'],
      dtype='object')

In [48]:
dict(visa_df.dtypes)

{'age': dtype('int64'),
 'job': dtype('O'),
 'marital': dtype('O'),
 'education': dtype('O'),
 'default': dtype('O'),
 'balance': dtype('int64'),
 'housing': dtype('O'),
 'loan': dtype('O'),
 'contact': dtype('O'),
 'day': dtype('int64'),
 'month': dtype('O'),
 'duration': dtype('int64'),
 'campaign': dtype('int64'),
 'pdays': dtype('int64'),
 'previous': dtype('int64'),
 'poutcome': dtype('O'),
 'y': dtype('O')}

In [49]:
# if i have a two list can i create
cols=visa_df.dtypes.index.tolist()
dtype==visa_df.dtypes.values.tolist()
pd.DataFrame(zip(cols,dtype))

            0       1
0         age   int64
1         job  object
2     marital  object
3   education  object
4     default  object
5     balance   int64
6     housing  object
7        loan  object
8     contact  object
9         day   int64
10      month  object
11   duration   int64
12   campaign   int64
13      pdays   int64
14   previous   int64
15   poutcome  object
16          y  object

**selection of data**

In [ ]:
visa_df.iloc[rows,columns]
visa_df.iloc[s:s:s,s:s:s]

In [ ]:
visa_df
# 100:105 rows  100,101,102,103,104
# 3:6            3,4,5,
visa_df.iloc[100:105,3:6]

In [51]:
visa_df.iloc[100:105,3:6] # 100 to 104 rows from 3 to 5 columns
visa_df.iloc[100:105] # 100 to 104 rows from all columns
visa_df.iloc[100] # 100th rows series
visa_df.iloc[[100]] # 100th row df
visa_df.iloc[[100,200,300]]
visa_df.iloc[[100,200,300],3:6] # only 3,6 
visa_df.iloc[[100,200,300],[1,5,9]]

             job  balance  day
100  blue-collar        0    6
200   technician      992    4
300      retired     4531   18

In [55]:
cols.index('education')

3

In [56]:
cols

['age',
 'job',
 'marital',
 'education',
 'default',
 'balance',
 'housing',
 'loan',
 'contact',
 'day',
 'month',
 'duration',
 'campaign',
 'pdays',
 'previous',
 'poutcome',
 'y']

In [59]:
# visa_df.loc[100:105,3:6] # 100 to 104 rows from 3 to 5 columns
# visa_df.loc[100:105] # 100 to 104 rows from all columns
# visa_df.loc[100] # 100th rows series
# visa_df.loc[[100]] # 100th row df
# visa_df.loc[[100,200,300]]
# visa_df.loc[[100,200,300],3:6] # only 3,6 
visa_df.loc[[100,200,300],
          ['duration','balance','education']]

     duration  balance  education
100       337        0  secondary
200       301      992   tertiary
300       445     4531    primary